# Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону 
# (т.е. не меньше заданного минимума и не больше заданного максимума)

list = [1, -5, 10, 2, 15, 14, 23, 101, 99, 108, 575, 3, 1, 18, 24, 83, 22]
index = []

max = int(input("Введите максимум: "))
min = int(input("Введите минимум: "))

for i in range(len(list)):
    if min < list[i] < max:
        index.append(i)

print(index)        
